#include <stdio.h>
int main(void)
{
    // 二维数组可以理解为由多个一维数组组成，但在内存其实和一维数组类似，也是连续存储
    //  int arr[3][4]; // 二维数组的定义，表示有3行，第一行就是一个一维数组，这一行有4列
    //  arr[0][0] = 1;
    //  arr[2][3] = 3;
    //  二维数组初始化赋值
    //  1、给出所有elemen
    // int arr[3][4] = {{1, 2, 3, 4},
    //                  {5, 6, 7, 8},
    //                  {9, 10, 11, 12}};            // 三个一维数组组成
    // int arr1[3][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9}; // 可以按一维数数组初始化方式赋值

    // 2、给出部份元素值，剩余的为0
    // int arr[3][4] = {{1}, {2}, {3}};
    // int arr[3][4] = {1, 2, 3};

    // 3、给出所有元素，可缺省最高维
    // int arr[][4]={1,2,3,3,4,5,6,7,8,9};
    int arr[][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13}; // 用花括号的元素个数去除列数，除不尽的情况就是整除后+1，多出部份用0赋值

    for (int i = 0; i < 4; i++)
    {
        for (int j = 0; j < 4; j++)
        {
            printf("%d\t", arr[i][j]);
        }
        printf("\n");
    }

    // 数组要注意：下标越界
    // 二维数组可以用二维数组的方式进行访问，也可以直接用以为数组的方式来进行访问
    int arr1[][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13};
    for (int i = 0; i < 16; i++)
    {
        printf("%d, ", arr1[i / 4][i % 4]); // 通过一维数组的方式描述
    }

    //三维数组：n个二维数组的集合
    int sarr[2][3][4];

    return 0;
}